import React , {useEffect} from 'react';
import classes from './Cylinder.module.css';
import NavigationBar from '../../NavigationBar/NavigationBar';
import Aos from 'aos';
import "aos/dist/aos.css";

const Cylinder = () => {

    useEffect(() => {
        Aos.init({duration: 500})
    }, []);

    let paragraphOne = "سیلندر خودرو قسمتی از موتور خودرو است که در هسته ی مرکزی آن قرار دارد. با انفجار سوخت در این مکان نیروی محرکه اتومبیل تامین میشود ( محفظه ی روغن موتور زیر بدنه موتور قرار دارد). این قطعه ، همانند استوانه ی توخالی میباشد که در بدنه ی بلوکه ساخته میشود. سیلندر ابتدا انرژی شیمیایی را به انرژی حرارتی تبدیل میکند سپس حرارتی به فشار تبدیل میشود ، سپس فشار به نیرو در نهایت نیرو منجر به حرکت پیستون میشود. در نتیجه ی این ۴ عمل زمانی که پیستون به سمت پایین حرکت خود را آغاز میکند و به علت تجمع در بالای پیستون فشار کم میشود و هوا و سوخت ، سیلندر را پر میکند. این ازدیاد سوخت در پیستون موجب میشود که محترق گردد. مهم ترین موضوعی که در سیلندر ها ملاک است ، کیفیت سطح آنها می‌باشد که با پیستون در ارتباط هستند.";

    let paragraphTwo = "یکی از عواملی که در بهبود سیلندر ها موثر می‌باشد ، صیقلی بودن سطح داخلی سیلندر است. دیواره های سیلندر معمولا از آلومینیوم و چدن است که با وجود تماس با پیستون و اصطکاک میان آنها لازم است ، صیقل زده شود. رعایت این موارد به دلیل جلوگیری از ایجاد حرارت و اتلاف انرژی میباشد. سیلندر قطعه ای است که برای موتور کاربرد های بسیاری دارد و بهترین نوع موتور ها هم آنهایی هستند که سیلندر و پیستون آن به شکل استوانه ای باشد. در این صورت است که پیستون میتواند بدون هیچ مشکل و یا لقی به حرکت خود ادامه دهد گاهی اوقات در اثر تنش ناشی از بستن پیچهای سرسیلندر ، ممکن است که سیلندر دچار چرخش شود ، که بسیاری از کارخانه های خودرو سازی راهکار های اصولی بستن سرسیلندر را تعیین کرده اند. با توجه به اطلاعات بدست آمده ، عواملی که موجب ایجاد خطراتی از جمله:‌ جلوگیری از آب‌ بندی محفظه عملیاتی و نشتی دود و گاز ، سوختن واشر سرسیلندر ، در سیلندر میشود ، سفت بستن پیچ سرسیلندر و همچنین شل بستن پیچ های آن هستند. با توجه به این عوامل ، دقت کنید که سرسیلندر را طبق اصول و قوانین گفته شده و همراه با آچار تورک سفت کنید تا مشکلی ایجاد نشود.عملیات ماشینکاری سیلندر خودرو در درجه حرارت محیط کارخانه حرارت دهی میشود. ولی موتور خودرو در دمای بسیار بالا کار میکند. هنگامی که پوسته ی سیلندر در برابر حرارت زیاد قرار میگیرد ، باعث ایجاد مشکل نمیشود ، ولی اگر بدنه ی سیلندر که از یک مجموعه ی فلزی تشکیل شده تحت حرارت بالا موجب انبساط غیر متقارن در سیلندر میشود و تنش های حرارتی موجب انبساط ناهمگون در سیلندر خواهد شد. ";

    let paragraphThree = "سیلندر ها استوانه های توخالی هستند که محل بالا و پایین رفتن پیستون میباشند. لیکن چگونگی و کیفیت سطح داخلی سیلندر ها که در تماس با پیستون است بسیار مهم است. دیواره های چدنی یا آلومینیومی سیلندر ها به منظور فراهم آوردن یک سطح صاف برای حرکت پیستون ها باید صیقل زده شود. صیقلی بودن سطح داخلی سیلندرها به خاطر کم کردن اصطکاک میان پیستون و جداره ی سیلندر است. البته بدیهی است که اصطکاک باعث تولید حرارت اضافی و هدر رفتن انرژی میشود که می‌بایست تا حد امکان از آن جلوگیری شود. سیلندر ها با پیستون هم اندازه هستند و قطر هر دو یکی است و پیستون نیز در سیلندر حرکت میکند. در برخی از مواقع جنس سیلندر ها را از چدن خاکستری یا آلیاژی از چدن میسازند. موادی که برای ساختن آلیاژ به کار میروند شامل نیکل ، کرم ، مس ، مولیبدن ، وانادیوم و تیتان میباشد. گفتیم که پیستون در داخل سیلندر قرار دارد و به قطعه ای به نام شاتون وصل است و حرکت رقت و برگشتی دارد. پیستون یکی از قطعات مهم موتور و سیلندر خودرو محسوب میشود و چهار وظیفه اصلی بر عهده ی آن میباشد. برخی از افراد تصور میکنند که پیستونی که به حالت استوانه ای شکل است از ایده آل برخوردار است ، درواقع اینگونه نیست و پیستون اصلی به شکل دایره و یا کمی مایل به بیضی شکل است.";

    let paragraphFour = "خدماتی که تراشکاری برای تعمیرات و بازسازی سیلندر ارائه میدهد عبارتند از تعمیر جای بوش سیلندر ، برقوی سیلندر ، پلیش بعد از برقو ، بوش زدن سیلندر ، آزمایش سیلندر ، تنظیم زدن ثابت سیلندر ، بازسازی شاتون زدگی سیلندر ، کف تراشی سیلندر"

    return (
        <div className={classes.root}>
            <NavigationBar />
            
            <div className={classes.row}>
                <div className={classes.paragraph} data-aos="flip-left">
                    {paragraphOne}
                    <img src="/image/services-cylinder-one.jpeg" className={classes.image}/>
                </div>
            </div>

            <br></br>
            <br></br>

            <div className={classes.row}>
                <div className={classes.paragraph} data-aos="flip-right">
                    {paragraphTwo}
                    <img src="/image/services-cylinder-two.jpeg" className={classes.image}/>
                </div>
            </div>

            <br></br>
            <br></br>

            <div className={classes.row}>
                <div className={classes.paragraph} data-aos="fade-right">
                    {paragraphThree}
                    <img src="/image/services-cylinder-three.jpeg" className={classes.image}/>
                </div>
            </div>

            <br></br>
            <br></br>

            <div className={classes.row}>
                <div className={classes.paragraph} data-aos="fade-left">
                    {paragraphFour}
                    <img src="/image/CylinderBoosh.jpg" className={classes.image}/>
                </div>
            </div>
        </div>
    );
}

export default Cylinder;