import React , {useEffect} from 'react';
import classes from './CylinderServices.module.css';
import NavigationBar from '../../NavigationBar/NavigationBar';
import CylinderServicesItem from './CylinderServicesItem/CylinderServicesItem';
import Aos from 'aos';
import "aos/dist/aos.css";

const CylinderServices = () => {

    useEffect(() => {
        Aos.init({duration: 500})
    }, []);

    const dictionary = [
        [ "تعمیر جای بوش سیلندر" , "/image/CylinderBoosh.jpg" , "CylinderBoosh" , "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.", null ],
        [ "برقوی سیلندر" , "/image/CylinderBoosh.jpg" , "CylinderBorghoo" , " لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد." , "fade-right"],
        [ "پلیش بعد از برقو" , "/image/CylinderBoosh.jpg" , "PolishAfterBorghoo" , "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد." , "fade-left"],
        [ "بوش زدن سیلندر" , "/image/CylinderBoosh.jpg" , "BooshingCylinder" , "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد." , "flip-left"],
        [ "آزمایش سیلندر" , "/image/CylinderBoosh.jpg" , "TestingCylinder" , "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد." , "flip-right"],
        [ "تنظیم زدن ثابت سیلندر"  , "/image/CylinderBoosh.jpg" , "AdjustingCylinderConstant" , "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد." , "flip-up"],
        [ "بازسازی شاتون زدگی سیلندر"  , "/image/CylinderBoosh.jpg" , "RemakingShatoon" , "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد." , "flip-down"],
        [ "کف تراشی سیلندر"  , "/image/CylinderBoosh.jpg" , "BottomCylinder" , "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد." , "zoom-in"],
    ];

    const cylinderServices = dictionary.map( item => {
        return (
            <div className={classes.cylinderitemdiv} data-aos={item[4]}>
                <CylinderServicesItem
                    key={item[0]} 
                    title={item[0]}
                    imageSource={item[1]}
                    imageSourceAlt={item[2]}
                    paragraphhh={item[3]}
                />
                <br></br>
            </div>
        );
    });

    return (
        <div>
            <NavigationBar />

            <div className={classes.belownav}>

                {cylinderServices}

            </div>
        </div>
    );
}

export default CylinderServices;

                {/* <div style={{width: "100%",display: "flex",justifyContent: "center"}}>
                    <CylinderServicesItem title="تعمیر جای بوش سیلندر" imageSource="/image/CylinderBoosh.jpg"
                    imageSourceAlt="CylinderBoosh" paragraphhh="شمسکیبتشنمسکیبتشنمسکیبتشسنمکیبتشنمسکیبتک
                    شسکمنیبتشنمسکیبتشنمسکیبتشنمسکیبتشمسنکیبتشنمسکیبت
                    شهخسعیبغشهخسعیبغشهخسعیغبشهخعسیبغشهخسعیبغشهخسعیبغشهخسعیبغ"/>
                </div> */}
                {/* <br></br>
                <br></br>

                <div style={{width: "100%",display: "flex",justifyContent: "center"}}>
                    <CylinderServicesItem title="برقوی سیلندر" imageSource="/image/CylinderBoosh.jpg" 
                    imageSourceAlt="CylinderBorghoo" paragraphhh="شمسشخسحهیبعشخحهسیبعشسهخحیبعشهخحسعیبهخحشس
                    رزدزردزردشسیبشسیبشسیبشسیبهخغهعغهخعغهخعغهخعغظطذدظطذدظطذدظطذدهخغخهعسیبهخعغهخعغسیب
                    شسخهعیبغشهخسعیبغشسهخعیبغشهخسعیبغیهسعبغیهخسعشبغیسهخعبغشهخسعیبغشهخسعیبغشهخعسیبغ"/>
                </div>    

                <br></br>
                <br></br>

                <div style={{width: "100%",display: "flex",justifyContent: "center"}}>
                    <CylinderServicesItem title="پلیش بعد از برقو" imageSource="/image/CylinderBoosh.jpg" 
                    imageSourceAlt="PolishAfterBorghoo" paragraphhh="شسخهبغشسهخعیبغشهخسعبغشهخسعیبغشهخعسیغب
                    شهسخیعبغشهسعیثقثصقثق۸۷ص۹ث۷ق۸۹صث۷ق۸۹ثصق۷۹ص۸ثق۷۹ثص۸ق۷ثص۸۹ق۷ث۹۸ق۷۹ث۸۷قص۹ثق۷۸۹ث۷ق۸۹ثص۷
                    ضصثقضصثقضصثقضصثقبیسبیسبیسبسیبیسبیسبذدزذدزذدزذدزذدزذدزذدزذزدذدزذدزذدزذدزذدزذدز"/>
                </div>

                <br></br>
                <br></br>

                <CylinderServicesItem title="بوش زدن سیلندر" imageSource="/image/CylinderBoosh.jpg" 
                imageSourceAlt="BoooshingTheCylinder" paragraphhh="شسیبشغسیهعبغشسهخعیبغشسعهخیبغشهسعخیبغ
                شسیتنمباشستنمیباشتنمسباشتنسمیباشتنمسیباشتنمسیابشتنمسیباشتنمسباشتنمسیباشتنمسیبا
                ضهخعصثقغضهخصعثقغهخضعصثقغضهخعصثقغضهخعصثقغضهخعصثقغضهعصثقغهخضعصقغضصهخعثقغضصهخعثقغضصهخعثقغ"/>

                <br></br>
                <br></br>

                <CylinderServicesItem title="آزمایش سیلندر" imageSource="/image/CylinderBoosh.jpg"
                imageSourceAlt="TestingTheCylinder" paragraphhh="۷۸شسی۶بش۸۹س۷یب۶شس۷۸۹یب۶شس۷۸۹یب۶شس۷۸۹ب
                ۲۳تنل۵۲۴۵۲۲ات۳۴ل۵اتلشسیبشسیبهعخشسیبهعشخسغیبهخعشسیبغشهخسعیبغشهخعسیغبهعخ
                ظطظعهذدغظهخعطذدغظهخعطذدغطظذهخعدغظهخعطذدغهعظدغعهسبشنیتسباتنمسیباشتنمسیباتنمشیاسب"/>

                <br></br>
                <br></br>

                <CylinderServicesItem title="تنظیم زدن ثابت سیلندر" imageSource="/image/CylinderBoosh.jpg"
                imageSourceAlt="AdjustingCylinderConstant" paragraphhh="شسیهخعبغشسیهخعبغشسهخعیبغ
                شسنمتیباشتنمسیباشتنمسیباشتنمسیباشتنمسیباشتنمسیباشتنمسیباشتنمسیباشتنمسباتنما
                ضصثقخضصغثهخقعغضصثهخعقغضصهخعثقغضصثقصض۷۶ق۸ضثص۷۸ق۶ض۷۸صثق۶ض۷۸صث۶ق۷۸ثضص۶ق۷۸ضثص۶ق۸۷ثص۶ضق۷۸"/>

                <br></br>
                <br></br>

                <CylinderServicesItem title="بازسازی شاتون زدگی سیلندر" imageSource="/image/CylinderBoosh.jpg"
                imageSourceAlt="ShatonHittingCylinder" paragraphhh="شسیبهعغشسهعخیبغشسهخعیبغشهخسعیبغش
                ششهخسعبغشسهخعیبغشسهخعیبغشهسعیبغشهخسعیبغشهخسعیبغشهخسعیبغشهخسعیبغشهخسعیبغ
                ظطذفدطظدطظفدظعغظطفدظطفدطظفدظطفدعطظغذفدعطغظفدعظففدشسیباشنسمتیباشتنمسیباشتنمسی"/>

                <br></br> 
                <br></br>

                <CylinderServicesItem title="کف تراشی سیلندر" imageSource="/image/CylinderBoosh.jpg" 
                imageSourceAlt="CylinderBottomShave" paragraphhh="شسهخعیبغشسهخعیبغشهخسعیبغشهخسعیبغشیهخسعب
                شنسمتیباشتنمسباشتنمسیباشتنمسیباتنمسیباشتنسمیباشتنمسیباشتنمسیباشستنمیباشتنسمیباشستنمیبا
                شسبشسیباشستنیباشستنمیباشستنمیباشستنمیباشسنمتیباشتنمسیباشتنسمیباشستنیباشمتن"/> */}
